---
kind: method
id: M:Autodesk.Revit.UI.DoubleClickOptions.Dispose
source: html/176d8ee1-9703-f099-af35-7a76127ce23f.htm
---
# Autodesk.Revit.UI.DoubleClickOptions.Dispose Method

Releases all resources used by the DoubleClickOptions

## Syntax (C#)
```csharp
public void Dispose()
```